Bartomiej Matuszewski, 405 693

Ćwiczenie:

Wykonaj zapytania za pomocą skryptów pythona:
    1. Ile kategorii filmów mamy w wypożyczalni?
    2. Wyświetl listę kategorii w kolejności alfabetycznej.
    3. Znajdź najstarszy i najmłodszy film do wypożyczenia.
    4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?
    5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?
    6. Znajdź największą płatność wypożyczenia.
    7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.
    8. Gdzie mieszkają członkowie personelu?
    9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?
    10. Jakie kategorie filmów zostały wypożyczone przez klientów?
    11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.
    12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

Dane do połączenia do bazy zdalnej

- host: pgsql-196447.vipserv.org
- port: 5432
- login: wbauer_adb
- hasło: adb2020
- nazwa_bazy: wbauer_adb

In [18]:
from sqlalchemy import create_engine
import pandas as pd
import psycopg2 as pg

host = "pgsql-196447.vipserv.org"
port = 5432
login = "wbauer_adb"
haslo = "adb2020"
nazwa_bd = "wbauer_adb"

connection = pg.connect(host='localhost', port=5432, dbname='test', user='postgres', password='admin')

In [19]:
connection = pg.connect(host=host, port=port, dbname=nazwa_bd, user=login, password=haslo)
df = pd.read_sql('select * from city', con=connection)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

1.Ile kategorii filmów mamy w wypożyczalni?

In [20]:

str1 = """
select
count(category.name)

from
category

"""

pd.read_sql(str1, connection)

   count
0     16

2.Wyświetl listę kategorii w kolejności alfabetycznej.

In [21]:
pd.read_sql('select name from category order by name ASC ', connection)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3.Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [22]:
str3a = """
SELECT
*
FROM
film
order by
release_year DESC,
film_id DESC
limit 1
"""
df_first = pd.read_sql(str3a, connection)

str3b = """
SELECT
*
FROM
film
order by
release_year ASC,
film_id ASC
limit 1
"""

df_last = pd.read_sql(str3b, connection)

df_first

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,2013-05-26 14:50:58.951,"[Trailers, Commentaries, Behind the Scenes]","'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona..."

In [23]:
df_last

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,2013-05-26 14:50:58.951,"[Deleted Scenes, Behind the Scenes]",'academi':1 'battl':15 'canadian':20 'dinosaur...

4.Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [24]:
str4 = """
select
count(rental_id)
from
rental
where
rental_date
between
'2005-07-01'
and
'2005-08-01'
"""

pd.read_sql(str4, connection)

   count
0   6709

5.Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [25]:
str5 = """
select
count(rental_id)
from
rental
where
rental_date
between
'2010-01-01'
and
'2011-02-01'
"""

pd.read_sql(str5, connection)

   count
0      0

6.Znajdź największą płatność wypożyczenia.

In [26]:
str6 = """
select
amount
from
payment
order by
amount DESC
limit 1
"""

pd.read_sql(str6, connection)

   amount
0   11.99

7.Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [27]:
str_test = """
select
*
from
country

"""

pd.read_sql(str_test, connection)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 09:44:00
1             2               Algeria 2006-02-15 09:44:00
2             3        American Samoa 2006-02-15 09:44:00
3             4                Angola 2006-02-15 09:44:00
4             5              Anguilla 2006-02-15 09:44:00
..          ...                   ...                 ...
104         105               Vietnam 2006-02-15 09:44:00
105         106  Virgin Islands, U.S. 2006-02-15 09:44:00
106         107                 Yemen 2006-02-15 09:44:00
107         108            Yugoslavia 2006-02-15 09:44:00
108         109                Zambia 2006-02-15 09:44:00

[109 rows x 3 columns]

In [28]:
str7 = """
select

*

from

customer

inner join address
on customer.address_id = address.address_id

inner join city
on address.city_id = city.city_id

inner join country
on city.country_id = country.country_id

where country.country = 'Poland'
or country.country = 'Nigeria'
or country.country = 'Bangladesh'

"""

pd.read_sql(str7, connection)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active,...,postal_code,phone,last_update,city_id,city,country_id,last_update,country_id,country,last_update
0,284,1,Sonia,Gregory,sonia.gregory@sakilacustomer.org,289,True,2006-02-14,2013-05-26 14:49:45.738,1,...,75860,195003555232,2006-02-15 09:45:30,69,Benin City,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
1,318,1,Brian,Wyman,brian.wyman@sakilacustomer.org,323,True,2006-02-14,2013-05-26 14:49:45.738,1,...,25787,556100547674,2006-02-15 09:45:30,97,Bydgoszcz,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
2,572,1,Sidney,Burleson,sidney.burleson@sakilacustomer.org,578,True,2006-02-14,2013-05-26 14:49:45.738,1,...,86587,867287719310,2006-02-15 09:45:30,133,Czestochowa,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
3,409,2,Rodney,Moeller,rodney.moeller@sakilacustomer.org,414,True,2006-02-14,2013-05-26 14:49:45.738,1,...,7122,653436985797,2006-02-15 09:45:30,141,Deba Habe,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
4,332,1,Stephen,Qualls,stephen.qualls@sakilacustomer.org,337,True,2006-02-14,2013-05-26 14:49:45.738,1,...,1195,38988715447,2006-02-15 09:45:30,143,Dhaka,12,2006-02-15 09:45:25,12,Bangladesh,2006-02-15 09:44:00
5,286,1,Velma,Lucas,velma.lucas@sakilacustomer.org,291,True,2006-02-14,2013-05-26 14:49:45.738,1,...,22650,558236142492,2006-02-15 09:45:30,152,Effon-Alaiye,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
6,80,1,Marilyn,Ross,marilyn.ross@sakilacustomer.org,84,True,2006-02-14,2013-05-26 14:49:45.738,1,...,20936,701457319790,2006-02-15 09:45:30,217,Ife,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
7,198,2,Elsie,Kelley,elsie.kelley@sakilacustomer.org,202,True,2006-02-14,2013-05-26 14:49:45.738,1,...,1545,768481779568,2006-02-15 09:45:30,218,Ikerre,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
8,103,1,Gladys,Hamilton,gladys.hamilton@sakilacustomer.org,107,True,2006-02-14,2013-05-26 14:49:45.738,1,...,3305,484292626944,2006-02-15 09:45:30,220,Ilorin,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
9,329,2,Frank,Waggoner,frank.waggoner@sakilacustomer.org,334,True,2006-02-14,2013-05-26 14:49:45.738,1,...,64308,965273813662,2006-02-15 09:45:30,234,Jamalpur,12,2006-02-15 09:45:25,12,Bangladesh,2006-02-15 09:44:00
10,128,1,Marjorie,Tucker,marjorie.tucker@sakilacustomer.org,132,True,2006-02-14,2013-05-26 14:49:45.738,1,...,4999,973047364353,2006-02-15 09:45:30,236,Jastrzebie-Zdrj,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
11,18,2,Carol,Garcia,carol.garcia@sakilacustomer.org,22,True,2006-02-14,2013-05-26 14:49:45.738,1,...,43331,747791594069,2006-02-15 09:45:30,252,Kaduna,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
12,270,1,Leah,Curtis,leah.curtis@sakilacustomer.org,275,True,2006-02-14,2013-05-26 14:49:45.738,1,...,83565,701767622697,2006-02-15 09:45:30,255,Kalisz,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
13,501,1,Ruben,Geary,ruben.geary@sakilacustomer.org,506,True,2006-02-14,2013-05-26 14:49:45.738,1,...,16370,52709222667,2006-02-15 09:45:30,314,Lublin,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
14,277,2,Olga,Jimenez,olga.jimenez@sakilacustomer.org,282,True,2006-02-14,2013-05-26 14:49:45.738,1,...,55802,363982224739,2006-02-15 09:45:30,374,Ogbomosho,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
15,156,1,Bertha,Ferguson,bertha.ferguson@sakilacustomer.org,160,True,2006-02-14,2013-05-26 14:49:45.738,1,...,21294,889538496300,2006-02-15 09:45:30,381,Ondo,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
16,280,2,Tracey,Barrett,tracey.barrett@sakilacustomer.org,285,True,2006-02-14,2013-05-26 14:49:45.738,1,...,36229,85059738746,2006-02-15 09:45:30,389,Owo,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
17,250,2,Jo,Fowler,jo.fowler@sakilacustomer.org,254,True,2006-02-14,2013-05-26 14:49:45.738,1,...,98332,716256596301,2006-02-15 09:45:30,390,Oyo,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
18,571,2,Johnnie,Chisholm,johnnie.chisholm@sakilacustomer.org,577,True,2006-02-14,2013-05-26 14:49:45.738,1,...,943,770864062795,2006-02-15 09:45:30,409,Plock,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
19,562,1,Wallace,Slone,wallace.slone@sakilacustomer.org,568,True,2006-02-14,2013-05-26 14:49:45.738,1,...,93655,946114054231,2006-02-15 09:45:30,488,Sokoto,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00
20,21,1,Michelle,Clark,michelle.clark@sakilacustomer.org,25,True,2006-02-14,2013-05-26 14:49:45.738,1,...,34418,892775750063,2006-02-15 09:45:30,525,Tangail,12,2006-02-15 09:45:25,12,Bangladesh,2006-02-15 09:44:00
21,380,1,Russell,Brinson,russell.brinson@sakilacustomer.org,385,True,2006-02-14,2013-05-26 14:49:45.738,1,...,75442,821476736117,2006-02-15 09:45:30,549,Tychy,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
22,558,1,Jimmie,Eggleston,jimmie.eggleston@sakilacustomer.org,564,True,2006-02-14,2013-05-26 14:49:45.738,0,...,97271,970638808606,2006-02-15 09:45:30,577,Wroclaw,76,2006-02-15 09:45:25,76,Poland,2006-02-15 09:44:00
23,232,2,Constance,Reid,constance.reid@sakilacustomer.org,236,True,2006-02-14,2013-05-26 14:49:45.738,1,...,31390,588964509072,2006-02-15 09:45:30,596,Zaria,69,2006-02-15 09:45:25,69,Nigeria,2006-02-15 09:44:00

8.Gdzie mieszkają członkowie personelu?

In [29]:
str8 = """
select
staff.first_name,
staff.last_name,
address.address,
address.address2,
city.city,
country.country

from
staff

inner join address
on staff.address_id = address.address_id

inner join city
on address.city_id = city.city_id

inner join country
on city.country_id = country.country_id
"""

pd.read_sql(str8, connection)

  first_name last_name               address address2        city    country
0       Mike   Hillyer     23 Workhaven Lane     None  Lethbridge     Canada
1        Jon  Stephens  1411 Lillydale Drive     None   Woodridge  Australia

9.Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [30]:
str9 = """
select
count(staff_id)

from
staff

inner join address
on staff.address_id = address.address_id

inner join city
on address.city_id = city.city_id

inner join country
on city.country_id = country.country_id
where country.country = 'Argentina'
or country.country = 'Spain'

"""

pd.read_sql(str9, connection)

   count
0      0

10.Jakie kategorie filmów zostały wypożyczone przez klientów?

In [31]:
str10 = """
select
distinct category.name,
film.title

from
customer

inner join rental
on customer.customer_id = rental.customer_id

inner join inventory
on rental.inventory_id = inventory.inventory_id

inner join film
on inventory.film_id = film.film_id

inner join film_category
on film.film_id = film_category.film_id

inner join category
on film_category.category_id = category.category_id
"""

pd.read_sql(str10, connection)

       name                title
0    Action         Amadeus Holy
1    Action      American Circus
2    Action   Antitrust Tomatoes
3    Action  Barefoot Manchurian
4    Action         Berets Agent
..      ...                  ...
953  Travel  Valentine Vanishing
954  Travel          Window Side
955  Travel        Wolves Desire
956  Travel        Worker Tarzan
957  Travel  Working Microcosmos

[958 rows x 2 columns]

11.Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [32]:
test = """
select
*
from
country
"""
pd.read_sql(test, connection)

     country_id               country         last_update
0             1           Afghanistan 2006-02-15 09:44:00
1             2               Algeria 2006-02-15 09:44:00
2             3        American Samoa 2006-02-15 09:44:00
3             4                Angola 2006-02-15 09:44:00
4             5              Anguilla 2006-02-15 09:44:00
..          ...                   ...                 ...
104         105               Vietnam 2006-02-15 09:44:00
105         106  Virgin Islands, U.S. 2006-02-15 09:44:00
106         107                 Yemen 2006-02-15 09:44:00
107         108            Yugoslavia 2006-02-15 09:44:00
108         109                Zambia 2006-02-15 09:44:00

[109 rows x 3 columns]

In [33]:
str11 = """
select
film.title,
category.name

from
customer

inner join rental
on customer.customer_id = rental.customer_id

inner join inventory
on rental.inventory_id = inventory.inventory_id

inner join film
on inventory.film_id = film.film_id

inner join film_category
on film.film_id = film_category.film_id

inner join category
on film_category.category_id = category.category_id

inner join address
on customer.address_id = address.address_id

inner join city
on address.city_id = city.city_id

inner join country
on city.country_id = country.country_id

where country.country = 'United States'
"""

pd.read_sql(str11, connection)

                 title      name
0           Swarm Gold    Horror
1      Musketeers Wait  Classics
2        Submarine Bed    Comedy
3         Purple Movie   Foreign
4      Armageddon Lost    Sci-Fi
..                 ...       ...
963  Strictly Scarface    Comedy
964    Airport Pollock    Horror
965      Orient Closer     Drama
966     Sting Personal       New
967  Comancheros Enemy  Children

[968 rows x 2 columns]

12.Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [34]:
str12 = """
select
film.title,
actor.first_name,
actor.last_name

from
customer

inner join rental
on customer.customer_id = rental.customer_id

inner join inventory
on rental.inventory_id = inventory.inventory_id

inner join film
on inventory.film_id = film.film_id

inner join film_actor
on film.film_id = film_actor.film_id

inner join actor
on film_actor.actor_id = actor.actor_id

where
(actor.first_name = 'Olympia' and actor.last_name = 'Pfeiffer')
or (actor.first_name = 'Julia' and actor.last_name = 'Zellweger')
or (actor.first_name = 'Ellen' and actor.last_name = 'Presley')

"""


pd.read_sql(str12, connection)

                     title first_name  last_name
0          Idols Snatchers    Olympia   Pfeiffer
1        Contact Anonymous    Olympia   Pfeiffer
2          Hollow Jeopardy      Julia  Zellweger
3               Wait Cider    Olympia   Pfeiffer
4     Microcosmos Paradise      Ellen    Presley
...                    ...        ...        ...
1078       Idols Snatchers    Olympia   Pfeiffer
1079      Murder Antitrust    Olympia   Pfeiffer
1080       Pinocchio Simon      Ellen    Presley
1081    Color Philadelphia    Olympia   Pfeiffer
1082  Microcosmos Paradise      Ellen    Presley

[1083 rows x 3 columns]